<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5a7bdee2b69180c14b2f1dab38fe28d50549c97508ccb4afc7ed262ac4743e89","plan_job_ref":"Job Run Terraform plan in staging #10 at https://github.com/GSA-TTS/review-repro/actions/runs/12712242442","plan_out_hash":"e9ee3d95730273a0c4a79fc5f5dc42bbb62bb90dd1af881f331c6e0006ac09fb","plan_hash":"f4741d6dac740ccfc46af672514063e1fac79215665631d8fa1675a0f69b4748","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2025-01-10T14:42:42Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "review_repro-staging"
+       readiness_health_check_type = (known after apply)
!~      source_code_hash            = "T1y76jt3W2QE09TXqezU3FGShRFh5ktUuMnoLhgvLSs=" -> "8KXBR9t1GoJQ7qReiTVqSua3wHur848SGYUWmY/XGV0="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-10T15:12:45Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #10](https://github.com/GSA-TTS/review-repro/actions/runs/12712242442)